"""
四、字典练习题：
1：根据需求写代码

     dic = {'k1': "v1", "k2": "v2", "k3": [11,22,33]}
     请在字典中添加一个键值对，"k4": "v4"，输出添加后的字典
     请在修改字典中 "k1" 对应的值为 "alex"，输出修改后的字典
     请在k3对应的值中追加一个元素 44，输出修改后的字典
     请在k3对应的值的第 1 个位置插入个元素 18，输出修改后的字典
"""
dic = {'k1': "v1", "k2": "v2", "k3": [11,22,33]}
print(dic)
# 请在字典中添加一个键值对，"k4": "v4"，输出添加后的字典
dic["k4"] = "v4"
print(dic)
# 请在修改字典中 "k1" 对应的值为 "alex"，输出修改后的字典
dic["k1"] = "alex"
print(dic)
# 请在k3对应的值中追加一个元素 44，输出修改后的字典
dic["k3"].append(44)
print(dic)
# 请在k3对应的值的第 1 个位置插入个元素 18，输出修改后的字典
dic["k3"].insert(0, 18)
print(dic)