"""
3：写代码，有如下列表，按照要求实现每一个功能。

    lis = [2, 3, "k", ["qwe", 20, ["k1", ["tt", 3, "1"]], 89], "ab", "adv"]

    将列表lis中的”k”变成大写，并打印列表。
    将列表中的数字3变成字符串”100”
    将列表中的字符串”tt”变成数字 101
    在 “qwe”前面插入字符串：”火车头”
"""
lis = [2, 3, "k", ["qwe", 20, ["k1", ["tt", 3, "1"]], 89], "ab", "adv"]
print(lis)
# 将列表lis中的”k”变成大写，并打印列表。
lis[2] = lis[2].upper()
print(lis)

#     将列表中的数字3变成字符串”100”
lis[1] = "100"
print(lis)
#     将列表中的字符串”tt”变成数字 101
lis[3][2][1][0] = 101
print(lis)
#     在 “qwe”前面插入字符串：”火车头”
lis[3].insert(0, "火车头")
print(lis)
